mcheah/Marlin4MPMD/stm32_cube/STM32/Drivers/BSP/STM32F4xx-3dPrinter/stm32f4xx_3dprinter_misc.c
/// Timer handler for tick
TIM_HandleTypeDef hTimTick;

/// Timer handler for tick2
TIM_HandleTypeDef hTimTick2;


/// Timer handler for servo
TIM_HandleTypeDef hTimServo;

/* Private constant ----------------------------------------------------------*/
static uint8_t bspTickEnabled = 0;

/* Imported function ----------------------------------------------------------*/
void BSP_MiscFlagInterruptHandler(void);
void SystemClock_Config(void);

/** @defgroup  STM32F4XX_3DPRINTER_MOTOR_Public_Functions
  * @{
  */   
/******************************************************//**
 * @brief  Global Init of the motors part of the 3D printer
 * @param[in] nbDevices Number of motor devices to use (from 1 to MAX_NUMBER_OF_DEVICES)
 * @param[in] pReceivedByte pointer to the received byte
 * @retval None
 **********************************************************/
void BSP_MiscOverallInit(uint8_t nbDevices)
{
   /* STM32xx HAL library initialization */
  HAL_Init();
  
  /* Configure the system clock */
  SystemClock_Config();
  
  /* System interrupt init*/
  /* This part overwrite configuration of priority grouping realized in HAL_Init()
   * Objective is to avoid change in HAL_Init()
   * Due to change in Priority Grouping, the system tick init shall be do again.
   */
  /* Set Interrupt Group Priority */
  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_3);
  /* Use systick as time base source and configure 1ms tick (default clock after Reset is HSI) */
  HAL_InitTick(TICK_INT_PRIORITY);
  
  //----- Init of the Motor control library to use nB device */
  bspMiscNbMotorDevices = nbDevices;
  BSP_MotorControl_Init(BSP_MOTOR_CONTROL_BOARD_ID_L6474, nbDevices);
  
  /* Attach the function MyFlagInterruptHandler (defined below) to the flag interrupt */
  BSP_MotorControl_AttachFlagInterrupt(BSP_MiscFlagInterruptHandler);

  /* Attach the function Error_Handler (defined below) to the error Handler*/
  BSP_MotorControl_AttachErrorHandler(BSP_MiscErrorHandler); 
}

/******************************************************//**
 * @brief  Handler of the motor flag interrupt
 * @param None
 * @retval None
 **********************************************************/
void BSP_MiscFlagInterruptHandler(void)
{
  uint16_t statusRegister;
  uint8_t loop;
  
  for (loop =0; loop < bspMiscNbMotorDevices; loop++)
  {
    /* Get the value of the status register via the L6474 command GET_STATUS */
    statusRegister = BSP_MotorControl_CmdGetStatus(loop);
    
    /* Check HIZ flag: if set, power brigdes are disabled */
    if ((statusRegister & L6474_STATUS_HIZ) == L6474_STATUS_HIZ)
    {
      // HIZ state
      // Action to be customized            
    }

    /* Check direction bit */
    if ((statusRegister & L6474_STATUS_DIR) == L6474_STATUS_DIR)
    {
      // Forward direction is set
      // Action to be customized            
    }  
    else
    {
      // Backward direction is set
      // Action to be customized            
    }  

    /* Check NOTPERF_CMD flag: if set, the command received by SPI can't be performed */
    /* This often occures when a command is sent to the L6474 */
    /* while it is in HIZ state */
    if ((statusRegister & L6474_STATUS_NOTPERF_CMD) == L6474_STATUS_NOTPERF_CMD)
    {
        // Command received by SPI can't be performed
       // Action to be customized            
    }  

    /* Check WRONG_CMD flag: if set, the command does not exist */
    if ((statusRegister & L6474_STATUS_WRONG_CMD) == L6474_STATUS_WRONG_CMD)
    {
       //command received by SPI does not exist 
       // Action to be customized          
    }  

    /* Check UVLO flag: if not set, there is an undervoltage lock-out */
    if ((statusRegister & L6474_STATUS_UVLO) == 0)
    {
       //undervoltage lock-out 
       // Action to be customized          
    }  

    /* Check TH_WRN flag: if not set, the thermal warning threshold is reached */
    if ((statusRegister & L6474_STATUS_TH_WRN) == 0)
    {
      //thermal warning threshold is reached
      // Action to be customized          
    }    

    /* Check TH_SHD flag: if not set, the thermal shut down threshold is reached */
    if ((statusRegister & L6474_STATUS_TH_SD) == 0)
    {
      //thermal shut down threshold is reached 
      // Action to be customized          
    }    

    /* Check OCD  flag: if not set, there is an overcurrent detection */
    if ((statusRegister & L6474_STATUS_OCD) == 0)
    {
      //overcurrent detection 
      // Action to be customized          
    }
  }
}


/******************************************************//**
 * @brief  General error handler
 * @param None
 * @retval None
 **********************************************************/
void BSP_MiscErrorHandler(uint16_t error)
{
  static char errorTxt[15] = "Error = 0x";
  char* errorTxtPtr;
  errorTxtPtr = errorTxt + strlen(errorTxt);
  /* Backup error number */
  bspMiscLastError = error;
  sprintf(errorTxtPtr, "%x\r\n",error);
  
  
  /* Disable heater */
#ifndef MARLIN
  BSP_MiscHeatPwmSetDutyCycle(0, 0);
  BSP_MiscHeatPwmSetDutyCycle(1, 0);
#else  
  BSP_MiscHeatManualInit(0);
  BSP_MiscHeatManualInit(1);
  BSP_MiscHeatManualInit(2);
  BSP_MiscHeatManualInit(3);
#endif  
  
  
  BSP_UartLockingTx((uint8_t *)&errorTxt, sizeof(errorTxt));
  
  /* Infinite loop */
  while(1)
  {
  }
}
/******************************************************//**
 * @brief  Initialisation of the Z probe
 * @param None
 * @retval None
 **********************************************************/
void BSP_MiscInitZProbeInit(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
  /* Configure IR_ON pin */
  GPIO_InitStruct.Pin = BSP_IR_ON_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
  HAL_GPIO_Init(BSP_IR_ON_PORT, &GPIO_InitStruct);
  
}

/******************************************************//**
 * @brief  Enabling of the Z probe
 * @param[in] enable 0 to disable, 1 to enable
 * @retval None
 **********************************************************/
void BSP_MiscInitZProbeEnable(uint8_t enable)
{
  if (enable == 0)  
  {
    HAL_GPIO_WritePin(BSP_IR_ON_PORT, BSP_IR_ON_PIN, GPIO_PIN_RESET); 
  }
  else
  {
    HAL_GPIO_WritePin(BSP_IR_ON_PORT, BSP_IR_ON_PIN, GPIO_PIN_SET); 
  }
}

/******************************************************//**
 * @brief  Initialisation of the stops
 * @param[in] id 0 for X_Stop, 1 for Y_Stop, 2 for Z_Stop
 * @retval None
 **********************************************************/
void BSP_MiscStopInit(uint8_t id)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;

