mcheah/Marlin4MPMD/stm32_cube/STM32/Drivers/BSP/STM32F4xx-3dPrinter/stm32f4xx_3dprinter_misc.c
  switch (id)
  {
    case 0:
      /* Configure X_STOP pin */
      gpioPin = BSP_STOP_X_PIN;
      gpioPort = BSP_STOP_X_PORT;    
#if ((!defined(MARLIN)) || (defined(BICEPHALE)))
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#else
      GPIO_InitStruct.Pull = GPIO_PULLUP;     
#endif  
      break;
    case 1:
      /* Configure Y_STOP pin */
      gpioPin = BSP_STOP_Y_PIN;
      gpioPort = BSP_STOP_Y_PORT;    
#if ((!defined(MARLIN)) || (defined(BICEPHALE)))
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#else
      GPIO_InitStruct.Pull = GPIO_PULLUP;     
#endif  
      break;      
    case 2:
      /* Configure Z_STOP pin */
      gpioPin = BSP_STOP_Z_PIN;
      gpioPort = BSP_STOP_Z_PORT;
      GPIO_InitStruct.Pull = BSP_STOP_Z__PULL_MODE;
      break;   
    case 3:
      /* Configure U_STOP pin */
      gpioPin = BSP_STOP_U_PIN;
      gpioPort = BSP_STOP_U_PORT;    
#ifndef MARLIN
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#else
      GPIO_InitStruct.Pull = GPIO_PULLUP;     
#endif
      break;  
    case 4:
      /* Configure V_STOP pin */
      gpioPin = BSP_STOP_V_PIN;
      gpioPort = BSP_STOP_V_PORT;    
#ifndef MARLIN
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#else
      GPIO_InitStruct.Pull = GPIO_PULLUP;     
#endif
      break;  
    case 5:
      /* Configure W_STOP pin */
      gpioPin = BSP_STOP_W_PIN;
      gpioPort = BSP_STOP_W_PORT;    
#ifndef MARLIN
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#else
      GPIO_InitStruct.Pull = GPIO_PULLUP;     
#endif
      break;        
    default:
      return;
  }
  GPIO_InitStruct.Pin = gpioPin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
  HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);      
}

/******************************************************//**
 * @brief  Get Stop status
 * @param[in] id 0 for X_Stop, 1 for Y_Stop, 2 for Z_Stop
  * @retval status 0 if GPIO is set, 1 if it reset
 **********************************************************/
uint8_t BSP_MiscStopGetStatus(uint8_t id)
{
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;
  uint8_t status = 0;
  
  switch (id)
  {
    case 0:
      /* Configure X_STOP pin */
      gpioPin = BSP_STOP_X_PIN;
      gpioPort = BSP_STOP_X_PORT;    
      break;
    case 1:
      /* Configure Y_STOP pin */
      gpioPin = BSP_STOP_Y_PIN;
      gpioPort = BSP_STOP_Y_PORT;    
      break;      
    case 2:
      /* Configure Z_STOP pin */
      gpioPin = BSP_STOP_Z_PIN;
      gpioPort = BSP_STOP_Z_PORT;    
      break;   
    default:
      return (status);
  }
  status = !((uint8_t) HAL_GPIO_ReadPin(gpioPort, gpioPin)); 
  return (status);
}

/******************************************************//**
 * @brief  Initialisation of the Heats
 * @param[in] id 0 for E1_FAN, 1 for E2, 2 for E3, 3 for E4
 * @retval None
 **********************************************************/
void BSP_MiscFanInit(uint8_t id)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;

  switch (id)
  {
    case 0:
      /* Configure E1 Fan pin */
      gpioPin = BSP_FAN_E1_PIN;
      gpioPort = BSP_FAN_E1_PORT;    
      break;
    case 1:
      /* Configure E2 Fan pin */
      gpioPin = BSP_FAN_E2_PIN;
      gpioPort = BSP_FAN_E2_PORT;    
      break;      
    case 2:
      /* Configure E3 Fan pin */
      gpioPin = BSP_FAN_E3_PIN;
      gpioPort = BSP_FAN_E3_PORT;      
      break;   
    default:
      return;
  }
  GPIO_InitStruct.Pin = gpioPin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
  HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);      
}

/******************************************************//**
 * @brief  Initialisation of the Heats
 * @param[in] id 0 for E1_FAN, 1 for E2, 2 for E3, 3 for E4
 * @param[in] speed from 0 (min speed) to 255 (full speed) 
 * @retval None
 **********************************************************/
void BSP_MiscFanSetSpeed(uint8_t id,uint8_t speed)
{
 uint32_t gpioPin;
 GPIO_TypeDef* gpioPort;

#ifndef MARLIN
 speed = 255; // Force speed to never stop the fan !!!
#endif 
 
  switch (id)
  {
    case 0:
      /* Configure E1 Fan pin */
      gpioPin = BSP_FAN_E1_PIN;
      gpioPort = BSP_FAN_E1_PORT;    
      break;
    case 1:
      /* Configure E2 Fan pin */
      gpioPin = BSP_FAN_E2_PIN;
      gpioPort = BSP_FAN_E2_PORT;    
      break;      
    case 2:
      /* Configure E3 Fan pin */
      gpioPin = BSP_FAN_E3_PIN;
      gpioPort = BSP_FAN_E3_PORT;      
      break;   
    default:
      return;
  }  
  
  if (speed != 0)
  {
     HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_SET); 
  }
  else
  {
     HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_RESET); 
  }
}

/******************************************************//**
 * @brief  Initialisation of the Tick timer 
 * @param None
  * @retval None
 **********************************************************/
void BSP_MiscTickInit(void)
{
  TIM_OC_InitTypeDef sConfigOC;
  TIM_MasterConfigTypeDef sMasterConfig;
#ifndef MARLIN
  hTimTick.Instance = BSP_MISC_TIMER_TICK;
  hTimTick.Init.Prescaler = TICK_TIMER_PRESCALER - 1;
  hTimTick.Init.CounterMode = TIM_COUNTERMODE_UP;
  hTimTick.Init.Period = 0;
  hTimTick.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_OC_Init(&hTimTick);

  sConfigOC.OCMode = TIM_OCMODE_TIMING;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  HAL_TIM_OC_ConfigChannel(&hTimTick, &sConfigOC, BSP_MISC_CHAN_TIMER_TICK);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&hTimTick, &sMasterConfig);
#else //#ifndef MARLIN
  hTimTick.Instance = BSP_MISC_TIMER_TICK;
  hTimTick.Init.Prescaler = TICK_TIMER_PRESCALER - 1;
  hTimTick.Init.CounterMode = TIM_COUNTERMODE_UP;
  if ((hTimTick.Instance != TIM2) && (hTimTick.Instance != TIM5))
  {
    hTimTick.Init.Period = 0xFFFF;
  }
  else
  {
    hTimTick.Init.Period = 0xFFFFFFFF;
  }
  hTimTick.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  if (hTimTick.Instance != TIM4)
  {
    sConfigOC.OCMode = TIM_OCMODE_TOGGLE;
  }
  else
  {
    sConfigOC.OCMode = TIM_OCMODE_TIMING;
  }
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH; 
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.Pulse = 0;
  
  HAL_TIM_OC_Init(&hTimTick);
  HAL_TIM_OC_ConfigChannel(&hTimTick, &sConfigOC, BSP_MISC_CHAN_TIMER_TICK);

