mcheah/Marlin4MPMD/stm32_cube/STM32/Drivers/BSP/STM32F4xx-3dPrinter/stm32f4xx_3dprinter_misc.c
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&hTimTick, &sMasterConfig);
#endif //else #ifndef MARLIN
}


/******************************************************//**
 * @brief  Sets the frequency of PWM_X used by device 0
 * @param[in] newPeriod in seconds
 * @retval None
 * @note The frequency is directly the current speed of the device
 **********************************************************/
void BSP_MiscTickSetFreq(uint32_t newFreq)
{
#ifndef MARLIN
    uint32_t sysFreq = HAL_RCC_GetSysClockFreq();
  uint32_t tick;
  uint32_t timPeriod = ((uint32_t)(sysFreq * newPeriod)/ TICK_TIMER_PRESCALER) - 1; 
  
  
  __HAL_TIM_SetAutoreload(&hTimTick, timPeriod);
  __HAL_TIM_SetCompare(&hTimTick, BSP_MISC_CHAN_TIMER_TICK, timPeriod >> 1);
  HAL_TIM_PWM_Start_IT(&hTimTick, BSP_MISC_CHAN_TIMER_TICK);  
  
  tick = __HAL_TIM_GetCounter(&hTimTick);
  if (timPeriod < tick)
  {
    __HAL_TIM_SetCounter(&hTimTick,0); //To prevent tick overlap workaround
  }
#else //#ifndef MARLIN

  uint32_t timPeriod;
  uint32_t timerCnt = hTimTick.Instance->CNT;
  if(newFreq > 10000) { 
    // If newFreq > 20kHz >> step 4 times
    newFreq = (newFreq >> 2)&0x3fff;
  }
  else if(newFreq > 5000) 
  { 
    // If newFreq > 10kHz >> step 2 times
    newFreq = (newFreq >> 1)&0x7fff;
  }
  
  timPeriod = (HAL_RCC_GetSysClockFreq()/ (TICK_TIMER_PRESCALER * (uint32_t)newFreq));
  if (timPeriod < 100) timPeriod = 100;
  
  __HAL_TIM_SetCompare(&hTimTick, BSP_MISC_CHAN_TIMER_TICK, timerCnt + timPeriod);
  
  if (bspTickEnabled == 0)
  {
     if ((BSP_MISC_CHAN_TIMER_TICK) == (TIM_CHANNEL_1))
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC1);
    }
    else if (BSP_MISC_CHAN_TIMER_TICK == TIM_CHANNEL_2)
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC2);
    }
    else if (BSP_MISC_CHAN_TIMER_TICK == TIM_CHANNEL_3)
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC3);
    }
    else if (BSP_MISC_CHAN_TIMER_TICK == TIM_CHANNEL_4)
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC4);
    }
    HAL_TIM_OC_Start_IT(&hTimTick,BSP_MISC_CHAN_TIMER_TICK);  
    bspTickEnabled = 1; 
  }
#endif //else #ifndef MARLIN  
}

/******************************************************//**
 * @brief  Sets the frequency of PWM_X used by device 0
 * @param[in] newPeriod in seconds
 * @retval None
 * @note The frequency is directly the current speed of the device
 **********************************************************/
void BSP_MiscTickSetPeriod(uint32_t newTimPeriod)
{
  uint32_t timerCnt = hTimTick.Instance->CNT + newTimPeriod;
  __HAL_TIM_SetCompare(&hTimTick, BSP_MISC_CHAN_TIMER_TICK, timerCnt);
    
}
/******************************************************//**
 * @brief  Stop the PWM used for the tick
 * @param[in] None
 * @retval None
  **********************************************************/
void BSP_MiscTickStop(void)
{
  HAL_TIM_PWM_Stop_IT(&hTimTick,BSP_MISC_CHAN_TIMER_TICK);  
  bspTickEnabled = 0;
}

/******************************************************//**
 * @brief  Initialisation of the Tick2 timer 
 * @param None
  * @retval None
 **********************************************************/
void BSP_MiscTick2Init(void)
{
  TIM_OC_InitTypeDef sConfigOC;
  TIM_MasterConfigTypeDef sMasterConfig;

  hTimTick2.Instance = BSP_MISC_TIMER_TICK2;
  hTimTick2.Init.Prescaler = TICK_TIMER_PRESCALER - 1;
  hTimTick2.Init.CounterMode = TIM_COUNTERMODE_UP;
  hTimTick2.Init.Period = 0;
  hTimTick2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_OC_Init(&hTimTick2);

  sConfigOC.OCMode = TIM_OCMODE_TIMING;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  HAL_TIM_OC_ConfigChannel(&hTimTick2, &sConfigOC, BSP_MISC_CHAN_TIMER_TICK2);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&hTimTick2, &sMasterConfig);

}


/******************************************************//**
 * @brief  Sets the frequency of PWM_X used by device 0
 * @param[in] newPeriod in seconds
 * @retval None
 * @note The frequency is directly the current speed of the device
 **********************************************************/
void BSP_MiscTick2SetFreq(float newPeriod)
{
  uint32_t sysFreq = HAL_RCC_GetSysClockFreq();
  uint32_t tick;
  uint32_t timPeriod = ((uint32_t)(sysFreq * newPeriod)/ TICK_TIMER_PRESCALER) - 1; 
  
  __HAL_TIM_SetAutoreload(&hTimTick2, timPeriod);
  __HAL_TIM_SetCompare(&hTimTick2, BSP_MISC_CHAN_TIMER_TICK2, timPeriod >> 1);
  HAL_TIM_PWM_Start_IT(&hTimTick2, BSP_MISC_CHAN_TIMER_TICK2);  
  
  tick = __HAL_TIM_GetCounter(&hTimTick2);
  if (timPeriod < tick)
  {
    __HAL_TIM_SetCounter(&hTimTick2,0); //To prevent tick overlap workaround
  }
}
/******************************************************//**
 * @brief  Stop the PWM used for the tick2
 * @param[in] None
 * @retval None
  **********************************************************/
void BSP_MiscTick2Stop(void)
{
  HAL_TIM_PWM_Stop_IT(&hTimTick2,BSP_MISC_CHAN_TIMER_TICK2);  
}

/******************************************************//**
 * @brief  Sets SW step clock mode (where step clocks are
 * not handled through HW PWMs but commutated by SW
 * @param None
 * @retval None
**********************************************************/
void BSP_MiscSetStepClockToSwMode(void)
{
  TIM_HandleTypeDef *pHTim;
  GPIO_InitTypeDef GPIO_InitStruct;
  uint8_t deviceId;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;  
  
  for (deviceId = 0; deviceId < bspMiscNbMotorDevices; deviceId++) 
  {
    switch (deviceId)
    {
      case 0:
      default:
        pHTim = &hTimPwmX;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_X;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_X_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_X_PORT;
        break;
      case  1:
        pHTim = &hTimPwmY;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_Y;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PORT;        
        break;
      case 2:
        pHTim = &hTimPwmZ;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_Z;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PORT;           
        break;
      case 3:
        pHTim = &hTimPwmE1;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_E1;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PORT;            
        break;
      case 4:
        pHTim = &hTimPwmE2;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_E2;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PORT;             
        break;
      case 5:
        pHTim = &hTimPwmE3;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_E3;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PORT;            
        break;
    }
    HAL_TIM_PWM_DeInit(pHTim);
  
