mcheah/Marlin4MPMD/stm32_cube/STM32/Drivers/BSP/STM32F4xx-3dPrinter/stm32f4xx_3dprinter_misc.c
  /* GPIO configuration */
    GPIO_InitStruct.Pin = gpioPin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
    HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);    
    HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_RESET); 

  }
}
/******************************************************//**
 * @brief Generate a step clock pulse
 * @param None
 * @retval None
**********************************************************/
void BSP_MiscGenerateStepClockPulse(uint8_t deviceId)
{
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;  

  switch (deviceId)
  {
    case 0:
    default:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PORT; 
      break;
    case  1:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PORT;        
      break;
    case 2:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_X_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_X_PORT;         
      break;
    case 3:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PORT;            
      break;
    case 4:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PORT;             
      break;
    case 5:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PORT;            
      break;
  }  
  
  HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_RESET); 
}
                                    
 /******************************************************//**
 * @brief Generate a step clock pulse
 * @param[in] device Id 
 * @param[in] current value in mA
 * @retval None
**********************************************************/
void BSP_MiscSetOcdThreshold(uint8_t deviceId, uint32_t current)
{
  int32_t currentThreshold = 375;
  uint32_t ocdThresholdParam = 0;
  
  while ((current >= currentThreshold) && (ocdThresholdParam < L6474_OCD_TH_6000mA))
  {
    currentThreshold += 375;
    ocdThresholdParam++;
  }
  
  BSP_MotorControl_CmdSetParam(deviceId, L6474_OCD_TH, ocdThresholdParam);   
}

/******************************************************//**
 * @brief  Initialises the Gpios uses by the specified Heats
 * @param[in] heatId (from 0 to 4)
 * @retval None
 * @note 0 for bead heat, 1 for E1 heat, 2 for E2 heat...
 **********************************************************/
void BSP_MiscHeatManualInit(uint8_t heatId)
{
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;  
  GPIO_InitTypeDef GPIO_InitStruct;
  
  switch (heatId)
  {
    case 0:
      gpioPin = BSP_HEAT_BED1_PIN;
      gpioPort = BSP_HEAT_BED1_PORT; 
      break;
    case  1:
      gpioPin = BSP_HEAT_E1_PIN;
      gpioPort = BSP_HEAT_E1_PORT; 
      break;
    case 2:
      gpioPin = BSP_HEAT_E2_PIN;
      gpioPort = BSP_HEAT_E2_PORT; 
      break;
    case 3:
      gpioPin = BSP_HEAT_E3_PIN;
      gpioPort = BSP_HEAT_E3_PORT; 
      break;
    case 5:
      gpioPin = BSP_HEAT_BED2_PIN;
      gpioPort = BSP_HEAT_BED2_PORT; 
      break;
    case 6:
      gpioPin = BSP_HEAT_BED3_PIN;
      gpioPort = BSP_HEAT_BED3_PORT; 
      break;      
  }
  /* GPIO configuration */
    GPIO_InitStruct.Pin = gpioPin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
    HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);    
    HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_RESET); 
}

/******************************************************//**
 * @brief  Initialises the PWM uses by the specified Heats
 * @param[in] heatId (from 0 to 4)
 * @retval None
 * @note 0 for bead heat, 1 for E1 heat, 2 for E2 heat...
 **********************************************************/
void BSP_MiscHeatPwmInit(uint8_t heatId)
{
  TIM_OC_InitTypeDef sConfigOC;
  TIM_MasterConfigTypeDef sMasterConfig;
  TIM_HandleTypeDef *pHTim;
  uint32_t  channel;
  uint32_t sysFreq = HAL_RCC_GetSysClockFreq();
  uint32_t period;
  
  switch (heatId)
  {
    case 0:
    default:
      pHTim = &hTimPwmHeatBed;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_BED;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED;
      break;
    case  1:
      pHTim = &hTimPwmHeatE1;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_E1;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E1;
      break;
    case 2:
      pHTim = &hTimPwmHeatE2;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_E2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E2;
      break;
    case 3:
      pHTim = &hTimPwmHeatE3;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_E3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E3;
      break;
    case 5:
      pHTim = &hTimPwmHeatBed2;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_BED2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED2;
      break;
    case 6:
      pHTim = &hTimPwmHeatBed3;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_BED3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED3;
      break;
  }
  period = (sysFreq/ (HEAT_TIMER_PRESCALER * HEAT_TIMER_FREQUENCY)) - 1;
  
  pHTim->Init.Prescaler = HEAT_TIMER_PRESCALER -1;
  pHTim->Init.CounterMode = TIM_COUNTERMODE_UP;
  pHTim->Init.Period = period;
  pHTim->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_PWM_Init(pHTim);
  
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  HAL_TIM_PWM_ConfigChannel(pHTim, &sConfigOC, channel);
  
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(pHTim, &sMasterConfig);
  
  HAL_TIM_PWM_Start(pHTim, channel);    
  
}
                                    
/******************************************************//**
 * @brief  Initialises the PWM uses by the specified Heats
 * @param[in] heatId (from 0 to 4)
 * @param[in] newDuty from 0 to 255
 * @retval None
 * @note 0 for bead heat, 1 for E1 heat, 2 for E2 heat...
 **********************************************************/
void BSP_MiscHeatPwmSetDutyCycle(uint8_t heatId, uint8_t newDuty)
{
  TIM_HandleTypeDef *pHTim;
  uint32_t  channel;
  uint32_t pulse;
  
  switch (heatId)
  {
  case 0:
  default:
      pHTim = &hTimPwmHeatBed;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED;
      break;
    case  1:
      pHTim = &hTimPwmHeatE1;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E1;
      break;
    case 2:
      pHTim = &hTimPwmHeatE2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E2;
      break;
    case 3:
      pHTim = &hTimPwmHeatE3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E3;
      break;
    case 5:
      pHTim = &hTimPwmHeatBed2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED2;
      break;
    case 6:
      pHTim = &hTimPwmHeatBed3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED3;
      break;
  }
  
  if (newDuty == 0) 
  {
    pulse = 0 ;
  }
  else 
  {
    pulse = pHTim->Init.Period * newDuty /255 + 1;
  }      
  __HAL_TIM_SetCompare(pHTim, channel, pulse);
}


/******************************************************//**
 * @brief  Initialize the Pwm used to control the servo motor
 * @param[in] pwmFreq frequency in Hz of the PWM 
 * @retval None
 * @note None
 **********************************************************/
void  BSP_MotorControlBoard_ServoInit(void)
{
  static TIM_OC_InitTypeDef sConfigOC;
  static TIM_MasterConfigTypeDef sMasterConfig;
  static TIM_ClockConfigTypeDef sClockSourceConfig;
  GPIO_InitTypeDef GPIO_InitStruct;
  TIM_HandleTypeDef *pHTim = NULL;
  uint32_t channel;
  
  pHTim = &hTimServo;
  pHTim->Instance = BSP_MISC_TIMER_SERVO;
  pHTim->Init.Prescaler = SERVO_TIMER_PRESCALER - 1;
  pHTim->Init.Period = 0;
  channel = BSP_MISC_CHAN_TIMER_SERVO;
  pHTim->Init.CounterMode = TIM_COUNTERMODE_UP;
  pHTim->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_OC_Init(pHTim);  

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(pHTim, &sClockSourceConfig); 
  
  sConfigOC.OCMode = TIM_OCMODE_TIMING;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  HAL_TIM_OC_ConfigChannel(pHTim, &sConfigOC, channel);

