mcheah/Marlin4MPMD/stm32_cube/STM32/Drivers/BSP/STM32F4xx-3dPrinter/stm32f4xx_3dprinter_misc.c
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(pHTim, &sMasterConfig);
  
  GPIO_InitStruct.Pin = BSP_SERVO0_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
  HAL_GPIO_Init(BSP_SERVO0_PORT, &GPIO_InitStruct);      
  HAL_GPIO_WritePin(BSP_SERVO0_PORT, BSP_SERVO0_PIN, GPIO_PIN_RESET);   
}
/******************************************************//**
 * @brief  Set the value of the Servo motor
 * @param[in] value
 * @retval None
 * @note None
 **********************************************************/
void  BSP_MotorControlBoard_ServoSetTimerValue(uint32_t value)
{
  __HAL_TIM_SET_AUTORELOAD(&hTimServo, value - 1);
  HAL_TIM_OC_Start_IT(&hTimServo, BSP_MISC_CHAN_TIMER_SERVO);
}
/******************************************************//**
 * @brief  Stop the timer used by the servo
 * @param None
 * @retval None
 * @note None
 **********************************************************/
void  BSP_MotorControlBoard_ServoStop(void)
{
  HAL_NVIC_ClearPendingIRQ(BSP_MISC_SERVO_IRQn);
  HAL_TIM_OC_Stop_IT(&hTimServo, BSP_MISC_CHAN_TIMER_SERVO);
  HAL_GPIO_WritePin(BSP_SERVO0_PORT, BSP_SERVO0_PIN, GPIO_PIN_SET);   
}

/******************************************************//**
 * @brief  Initialisation of the user GPIOs
 * @param[in] id 0 for USER_1, 1 for USER_2, 2 for USER_3, 3 for USER_4
 * @param[in] mode GPIO_MODE_INPUT, GPIO_MODE_OUTPUT_PP ... look at definitions 
 * in stm32f4xx_hal_gpio.h
 * @param[in] pull GPIO_NOPULL, GPIO_PULLUP, GPIO_PULLDOWN
 * @retval None
 **********************************************************/
void BSP_MiscUserGpioInit(uint8_t id, uint32_t mode, uint32_t pull)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;

  switch (id)
  {
    case 0:
      /* Configure user 1 pin */
      gpioPin = BSP_USER_1_PIN;
      gpioPort = BSP_USER_1_PORT;    
      break;
    case 1:
      /* Configure user 2 pin */
      gpioPin = BSP_USER_2_PIN;
      gpioPort = BSP_USER_2_PORT;      
      break;      
    case 2:
      /* Configure user 3 pin */
      gpioPin = BSP_USER_3_PIN;
      gpioPort = BSP_USER_3_PORT;       
      break;   
    case 3:
      /* Configure user 4 pin */
      gpioPin = BSP_USER_4_PIN;
      gpioPort = BSP_USER_4_PORT;      
      break;  
    default:
      return;
  }
  GPIO_InitStruct.Pin = gpioPin;
  GPIO_InitStruct.Mode = mode;
  GPIO_InitStruct.Pull = pull;
  GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
  HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);      
}


/**
  * @}
  */    

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
